1s/ERP/Conf/Documents/Лико_ЗабраковкаМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗабраковкаМатериалов</Name>
			<Comment>++ kit:mih web 08.07.21</Comment>
			<BasedOn>
				<xr:Item>Document.ТС_ЗаявкаНаРемонтРабочихЦентров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_БракСерий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоОбнаружения</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_МестаОбнаруженияБракаМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОбнаружившийБрак</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дефект</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДефектыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДефекта</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Решение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РешенияПоБракуМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийКРешению</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринявшийРешение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОформившийОбразец</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРезкиМатериала</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Акт</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПретензии</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусыПретензийПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыставленияПретензии</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОжиданияОтвета</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВозвратаПоставщику</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыВозвратовПоставщикам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБрака</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончательноеРешение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражКВМ</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражСтрокой</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоПоРешениюОтправлено</Name>
					<Comment>//++ kit:mih web 14.07.21  - Технический реквизит используется для отслеживания отправлено ли письмо на почту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоКладовщикамОтправлено</Name>
					<Comment>//++ kit:mih web 14.07.21  - Технический реквизит используется для отслеживания отправлено ли письмо на почту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>//Технический реквизит, необходим хранения документа основания</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовыйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбразцыПриложеныКНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетражПМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныеНомераРоликов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражПМ</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетражКВМ</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ЦеныГруппНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ЦеныГруппНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотериНаРезке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладскиеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Экосбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Лико_РегистраторыЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоРасчетЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ПараметрыРасчетаНормативов</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗабраковкаМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СтандартныеПроцедуры

Перем глПодключаемоеОборудованиеСобытиеОбработано;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
		
	//++ kit:mih web 16.07.21
	Если Параметры.Свойство("СотрудникПринявшийРешение") Тогда
		Объект.СотрудникПринявшийРешение = Параметры.СотрудникПринявшийРешение;
	КонецЕсли;
	//-- kit:mih web 16.07.21
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьСвязанныеДанныеНаСервере();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
		Если НЕ ЗначениеЗаполнено(Объект.Организация) И Объект.Автор.Лико_Площадки.Количество() > 0 Тогда
			Объект.Организация = Объект.Автор.Лико_Площадки[0].Организация;
		КонецЕсли;
		ЭтоНовыйДокумент = Истина;
		Объект.Дата = ТекущаяДата();
		Записать();
	КонецЕсли;
	
	////+AttachFiles
	
	payload = Новый Структура;
	payload.Вставить("DocName","Лико_ЗабраковкаМатериалов");
	payload.Вставить("DocNumber",Объект.Номер);
	payload.Вставить("DocDate",Объект.Дата); 	
	
	Структура = Новый Структура;
	Структура.Вставить( "action","attach-files");
	Структура.Вставить( "payload",payload);
	Структура.Вставить("ttl",30); 	
	
	Json    = WebSocketСервер.СтруктураВJSON(Структура); 		
	Settings= WebSocketСервер.SettingsTest();
	Token   = WebSocketСервер.ПолучитьToken(Settings);  
	
	ssl      = Новый ЗащищенноеСоединениеOpenSSL();
	
	Массив = Новый Массив();
	Массив.Добавить(Новый Структура("Authorization", СтрШаблон("Bearer %1",Token)));
	
	HttpRespons     = WebSocketСервер.HttpRequest(Settings.domain,Settings.ApiEndPoint_AttachFiles,Json,ssl,,Массив);
	ОтветПотокаJSON = WebSocketСервер.ПолучитьОтветJSON(HttpRespons);		
	
	Если ОтветПотокаJSON.Свойство("uuid") Тогда 
		uuid_=ОтветПотокаJSON.uuid;
		 КодРабочегоМеста=WebSocketСервер.ПолучитьКодРабочегоМеста();

		Урл=WebSocketСервер.url(WebSocketСервер.settingsTest(),Новый Структура("ext,subject",uuid_,КодРабочегоМеста));  	
	КонецЕсли;
	
	url=Урл;
	// Подсистема WebSocket
	ПоказыватьQRCode=Ложь; 
	

	WebSocketСервер.ИнициализацияNew(ЭтаФорма,ПоказыватьQRCode,,WebSocketСервер.SettingsTest(),url);
	// Подсистема WebSocket
	
	
	
	////-AttachFiles
	

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЭтоНовыйДокумент И ЗначениеЗаполнено(ГлЛико_Оператор) И ГлЛико_Оператор <> Объект.Автор Тогда
		Объект.Автор = ГлЛико_Оператор;
	КонецЕсли;
	
	//++ kit:mih web 11.07.21
	УстановкаВидимостиРеквизитов();
	
	//Подключение внешнего оборудования
	ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	//-- kit:mih web 11.07.21
	
	ПодключитьОбработчикОжидания("ИзменитьШиринуQR", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьШиринуQR()
	
	ЭлементWebSocketURL = Элементы.Найти("WebSocketURL");
	Если ЭлементWebSocketURL <> Неопределено Тогда
		ЭлементWebSocketURL.Ширина = 19;
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Расчет МетражКВМ и заполнение МетражСтрокой ++ kit:mih web 11.07.21
	Объект.МетражСтрокой = "";
	Объект.МетражКВМ = 0;
	Для Каждого Строка Из Объект.Материалы Цикл
		
		Объект.МетражКВМ = Объект.МетражКВМ + Строка.МетражКВМ;
		Если Объект.МетражСтрокой = "" Тогда
			Объект.МетражСтрокой = "" + Строка.Нарезка + " - " +  Строка.МетражКВМ;
		Иначе
			Объект.МетражСтрокой = Объект.МетражСтрокой + ", " + Строка.Нарезка + " - " +  Строка.МетражКВМ;
		КонецЕсли;
		
	КонецЦикла;	
	//-- kit:mih web 16.07.21
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	//Отправка сообщений //++ kit:mih web 14.07.21
	//Если ЗначениеЗаполнено(Объект.Решение) И НЕ Объект.ПисьмоПоРешениюОтправлено Тогда
	//	Лико_ДополнительноКлиент.НачатьОтправкуСообщения(Объект.Ссылка, "ПоРешению", ПользователиКлиент.ТекущийПользователь(), ПолучитьМакетНаСервере("ФормаПисьмаДляЭлектроннойПочты"));
	//	Объект.ПисьмоПоРешениюОтправлено = Истина;
	//	Записать();
	//ИначеЕсли ЗначениеЗаполнено(Объект.ТипВозвратаПоставщику) И НЕ Объект.ПисьмоКладовщикамОтправлено Тогда
	//	Лико_ДополнительноКлиент.НачатьОтправкуСообщения(Объект.Ссылка, "Кладовщикам", ПользователиКлиент.ТекущийПользователь(), ПолучитьМакетНаСервере("ФормаПисьмаДляЭлектроннойПочты"));
	//	Объект.ПисьмоКладовщикамОтправлено = Истина;
	//	Записать();
	//КонецЕсли;
	//-- kit:mih web 14.07.21
	
	Лико_Дополнительно.ПроверитьНеобходимостьИОтправитьПисьмоПоЗабраковкеМатериалов(Объект.Ссылка, Неопределено);
	Прочитать();
	
	ЭтоНовыйДокумент = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	//++ kit:mih web 16.07.21
	МенеджерОборудованияКлиентПереопределяемый.НачатьОтключениеОборудованиеПриЗакрытииФормы(ЭтаФорма);
	//-- kit:mih web 16.07.21
	Если ЭтоНовыйДокумент И НЕ ЗавершениеРаботы Тогда
		УдалитьДокументНепосредственно(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование //++ kit:mih web 16.07.21
	//Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
	//	Если ИмяСобытия = "ScanData" Тогда
	//		МассивСтруктурДанных = МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
	//		МассивШтрихКодов = Новый Массив;
	//					
	//		//Для Каждого ЭлементМассива Из МассивСтруктурДанных Цикл
	//		Если МассивСтруктурДанных.Количество() > 0 Тогда
	//			МассивШтрихКодов.Добавить(МассивСтруктурДанных[0].Штрихкод);	
	//		КонецЕсли;
	//		//КонецЦикла;
	//		
	//		ОбработатьШтрихкоды(МассивШтрихКодов);	
	//	КонецЕсли;
	//КонецЕсли;
	// Конец ПодключаемоеОборудование //-- kit:mih web 16.07.21
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			ОбработатьШтрихкоды(ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКнопок
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	Если Команда.Имя = "ПодменюПечатьОбычное_АктБрака" И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		НеобходимыеРеквизиты = Лико_Дополнительно.ПолучитьЗначенияРеквизитовСсылки(Объект.Ссылка, "СотрудникПринявшийРешение,Дефект,ОписаниеДефекта");
		Структура = Новый Структура;
		Структура.Вставить("СсылкаНаОбъект",Объект.Ссылка);
		//Структура.Вставить("ПредседательКомисии",Объект.ЧленКомиссии1) ;
		//Структура.Вставить("ГлавныйТехнолог", НеобходимыеРеквизиты.СотрудникПринявшийРешение);
		//Структура.Вставить("НачальникОтделаЗакупок",Объект.ЧленКомиссии3) ;
		//Структура.Вставить("ОписаниеНедостатков", "" + НеобходимыеРеквизиты.Дефект + ?(ЗначениеЗаполнено(НеобходимыеРеквизиты.ОписаниеДефекта), " (" + НеобходимыеРеквизиты.ОписаниеДефекта + ")", ""));
		ОткрытьФорму("Обработка.ЯССМ_АктБрака.Форма.ОтчетУпр",Структура,,,,,,);
		Возврат;
	КонецЕсли;
	
	Если Команда.Имя = "ПодменюПечатьОбычное_ОбразецНПБракМатериала" И НЕ ЗначениеЗаполнено(Объект.СотрудникОформившийОбразец) Тогда
		Объект.СотрудникОформившийОбразец = ?(ЗначениеЗаполнено(ГлЛико_Оператор), ГлЛико_Оператор, ПользователиКлиент.ТекущийПользователь());
		Записать();
		Прочитать();
	КонецЕсли;

    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура АктБрака(Команда) //++ kit:mih web 16.07.21
	
	Структура = Новый Структура;
	Структура.Вставить("СсылкаНаОбъект",Объект.Акт);
	//Структура.Вставить("ПредседательКомисии",Объект.ЧленКомиссии1);
	Структура.Вставить("ГлавныйТехнолог",Объект.СотрудникПринявшийРешение);
	//Структура.Вставить("НачальникОтделаЗакупок",Объект.ЧленКомиссии3);
	Структура.Вставить("ОписаниеНедостатков",Объект.ОписаниеДефекта);
	ОткрытьФорму("Обработка.ЯССМ_АктБрака.Форма.ОтчетУпр",Структура);

КонецПроцедуры //-- kit:mih web 16.07.21

#КонецОбласти

#Область ПодключениеОборудованиеИОбработкаШтрихКодов
&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкода)
	
	Результат = Лико_ДополнительноКлиент.ОбработатьШтрихКодНеТовара(ДанныеШтрихкода.Штрихкод);
	Если Результат.Ошибка <> "" Тогда
		Сообщить(Результат.Ошибка);
	Иначе
		Если Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Сотрудника") Тогда
			Объект.СотрудникОбнаружившийБрак = Результат.Сотрудник;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры_Короткий") Или 
			Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ОбъектаНоменклатуры") Тогда
			Если ЗначениеЗаполнено(Результат.ОбъектНоменклатуры) Тогда
				ОбработатьШКОбъектаНоменклатуры(Результат.ОбъектНоменклатуры);
			Иначе
				Сообщить("Объект номенклатуры не найден");
			КонецЕсли;
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_ЗаказаСпецификации") ИЛИ Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_Заказа") Тогда
			Объект.ЗаказКлиента = Лико_Дополнительно.НайтиДокументПоНомеру7Символов(Результат.НомерЗаказа, "ЗаказКлиента");
		ИначеЕсли Результат.ВидШК = ПредопределенноеЗначение("Перечисление.ЯС_ВидыШК.ШК_РабочегоЦентра") Тогда
			Объект.РабочийЦентр = Результат.РабочийЦентр;
		Иначе
			Сообщить("Штрихкод вида """ + Результат.ВидШК + """ не поддерживается в данном документе");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьШКОбъектаНоменклатуры(ОбъектНоменклатуры)
	
	Если Объект.Материалы.НайтиСтроки(Новый Структура("Серия", ОбъектНоменклатуры.Серия)).Количество() = 0 Тогда // --> Начало Лико Ефимов ЕВВ 27.10.2021 
		НоваяСтрока = Объект.Материалы.Добавить();
		Модифицированность = Истина;
		НоваяСтрока.Номенклатура = ОбъектНоменклатуры.Номенклатура;
		НоваяСтрока.Серия 		 = ОбъектНоменклатуры.Серия;
		НоваяСтрока.Количество	 = ОбъектНоменклатуры.Количество;
		НоваяСтрока.МетражПМ     = НоваяСтрока.Количество;
		НоваяСтрока.КоэффициентПересчетаУУ = ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель;
		НоваяСтрока.МетражКВМ    = НоваяСтрока.Количество * НоваяСтрока.КоэффициентПересчетаУУ;
		НоваяСтрока.Нарезка	     = ОбъектНоменклатуры.Нарезка; 
		//Субботин 30.11.22
		НоваяСтрока.Цена 		 = ПолучитьЦену(ОбъектНоменклатуры.Номенклатура, Объект.Организация, Объект.Дата);
		//Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМатериалы;
	КонецЕсли;
	
КонецПроцедуры


          
// Подсистема WebSocket
&НаКлиенте
Процедура WebSocketURLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	WebSocketКлиент.ОбработкаСообщения(ЭтаФорма,Элемент, ДанныеСобытия, СтандартнаяОбработка);	
КонецПроцедуры  

&НаКлиенте
Процедура WebSocketОбработкаШтрихКода() Экспорт 
	Если ВводДоступен() Тогда
		ОбработатьШтрихкоды(WebSocketMessage.content.ScanData);
	КонецЕсли;   
КонецПроцедуры 

// Подсистема WebSocket



//Процедура ОбработатьШтрихкоды(ШтрихКоды) //++ kit:mih web 16.07.21

//	ДанныеОбъектовНоменклатур = Новый Соответствие;
//	Для Каждого СтрокаДанных Из ШтрихКоды Цикл
//		ДанныеОбъектовНоменклатур.Вставить(СтрокаДанных, Новый Структура);
//	КонецЦикла;
//	
//	Лико_Дополнительно.ЗаполнениеКоллекцииОбъектовНоменклатурыПоШтрихКоду(ДанныеОбъектовНоменклатур, ШтрихКоды);
//	


//	Для Каждого Запись Из ДанныеОбъектовНоменклатур Цикл
//		
//		Если Запись.Значение.Свойство("ОШИБКА") Тогда
//			
//			ОбщегоНазначенияКлиент.СообщитьПользователю("Невозможно обработать данный штрихкод");
//			Прервать;
//			
//		КонецЕсли;
//		
//		Если НЕ ТипЗнч(Запись.Значение) = Тип("Структура") ИЛИ НЕ Запись.Значение.Свойство("НОМЕНКЛАТУРА") Тогда
//			
//			ОбщегоНазначенияКлиент.СообщитьПользователю("Невозможно обработать данный штрихкод");
//			Прервать;
//			
//		Иначе

//			Если Объект.Материалы.НайтиСтроки(Новый Структура("Серия", Запись.Значение["СЕРИЯ"])).Количество() = 0 Тогда // --> Начало Лико Ефимов ЕВВ 27.10.2021 
//				НоваяСтрока = Объект.Материалы.Добавить();
//				Модифицированность = Истина;
//				НоваяСтрока.Номенклатура = Запись.Значение["НОМЕНКЛАТУРА"];
//				НоваяСтрока.Серия 		 = Запись.Значение["СЕРИЯ"];
//				НоваяСтрока.Количество	 = Запись.Значение["КОЛИЧЕСТВО"];
//				НоваяСтрока.МетражПМ     = Запись.Значение["КОЛИЧЕСТВО"];
//				НоваяСтрока.МетражКВМ    = Запись.Значение["КОЛИЧЕСТВО"] * Запись.Значение["ЧИСЛИТЕЛЬ"];
//				НоваяСтрока.Нарезка	     = Запись.Значение["НАРЕЗКА"];
//				// --> Начало Лико Ефимов ЕВВ 27.10.2021 
//				НоваяСтрока.КоэффициентПересчетаУУ = Запись.Значение["ЧИСЛИТЕЛЬ"];
//				Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаМатериалы;
//				// <-- Конец Лико Ефимов ЕВВ 27.10.2021
//			КонецЕсли;
//		КонецЕсли;
//		
//	КонецЦикла;	
//	
//КонецПроцедуры //-- kit:mih web 16.07.21

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	//++ kit:mih web 16.07.21
	// ПодключаемоеОборудование
    // Подготовить данные
    
	//ОписаниеСобытия = Новый Структура();
	//ОписаниеОшибки  = "";
	//
	//ОписаниеСобытия.Вставить("Источник", Источник);
	//ОписаниеСобытия.Вставить("Событие",  Событие);
	//ОписаниеСобытия.Вставить("Данные",   Данные);
	//
	//глПодключаемоеОборудованиеСобытиеОбработано = Ложь;
	//
	//// Передать на обработку данные.
	//Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	//Если Не Результат Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='При обработке внешнего события от устройства произошла ошибка.'")
	//	+ Символы.ПС + ОписаниеОшибки);
	//Иначе
	//	глПодключаемоеОборудованиеСобытиеОбработано = Истина;
	//КонецЕсли;
    // Конец ПодключаемоеОборудование
	//-- kit:mih web 16.07.21
	
КонецПроцедуры
	
#КонецОбласти

#Область ДополнительныеПроцедурыИФункции

&НаКлиенте
Процедура УстановкаВидимостиРеквизитов()  //++ kit:mih web 16.07.21
	
	Доступ =  ПроверкаРолей();
	
	Элементы.МестоРезкиМатериала.Доступность = Доступ;
	Элементы.Поставщик.Доступность = Доступ;
	Элементы.Акт.Доступность = Доступ;
	Элементы.СтатусПретензии.Доступность = Доступ;
	Элементы.ДатаВыставленияПретензии.Доступность = Доступ;
	Элементы.ДатаОжиданияОтвета.Доступность = Доступ;
	Элементы.Ответ.Доступность = Доступ;
	Элементы.ТипВозвратаПоставщику.Доступность = Доступ;
	Элементы.СуммаБрака.Доступность = Доступ;
	Элементы.Валюта.Доступность = Доступ;
	Элементы.ОкончательноеРешение.Доступность = Доступ;
	Элементы.ДатаВыполнения.Доступность = Доступ;
	Если ЗначениеЗаполнено(Объект.РабочийЦентр) Тогда
		Элементы.РабочийЦентр.Доступность = Истина;
		Элементы.МестоОбнаружения.Доступность = Ложь;
	ИначеЕсли ЗначениеЗаполнено(Объект.МестоОбнаружения) Тогда
		Элементы.РабочийЦентр.Доступность = Ложь;
		Элементы.МестоОбнаружения.Доступность = Истина;
	Иначе
		Элементы.РабочийЦентр.Доступность = Истина;
		Элементы.МестоОбнаружения.Доступность = Истина;
		Элементы.РабочийЦентр.АвтоОтметкаНезаполненного = Истина;
		Элементы.МестоОбнаружения.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
	
КонецПроцедуры  //-- kit:mih web 16.07.21

&НаСервере
Функция ПроверкаРолей() //++ kit:mih web 16.07.21
	
	Доступ = Ложь;
	Если РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("Лико_ПретензииПоставщикам") Тогда
		Доступ = Истина;
	КонецЕсли;

	Возврат Доступ;
	
КонецФункции  //-- kit:mih web 16.07.21
	
&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)//++ kit:mih web 14.07.21
	Возврат РеквизитФормыВЗначение("Объект").ПолучитьМакет(ИмяМакета)	
КонецФункции //-- kit:mih web 14.07.21

#КонецОбласти

&НаСервере
Процедура ЗаполнитьСвязанныеДанныеНаСервере()
	
	Для каждого Строка из Объект.Материалы Цикл
		Строка.КоэффициентПересчетаУУ = Строка.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьСвязанныеДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыСерияПриИзменении(Элемент)
	//МатериалыСерияПриИзмененииНаСервере( );
	
	
	ТекущаяСтрока 							= 	Элементы.Материалы.ТекущиеДанные;
	ОбъектНоменклатуры						=	ПолучитьДанныеПоОбъектуНоменклатуры(Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ТекущаяСтрока.Серия,"ЯССМ_ОбъектНоменклатуры"));	
	ТекущаяСтрока.Номенклатура 				= 	ОбъектНоменклатуры.Номенклатура;
	ТекущаяСтрока.Серия 		 			= 	ОбъектНоменклатуры.Серия;
	ТекущаяСтрока.Количество	 			= 	ОбъектНоменклатуры.Количество;
	ТекущаяСтрока.МетражПМ     				= 	ОбъектНоменклатуры.Количество;

	ТекущаяСтрока.КоэффициентПересчетаУУ 	= 	ОбъектНоменклатуры.КоэффициентПересчетаУУ;
	ТекущаяСтрока.МетражКВМ    				= 	ТекущаяСтрока.Количество * ТекущаяСтрока.КоэффициентПересчетаУУ;
	ТекущаяСтрока.Нарезка	     			= 	ОбъектНоменклатуры.Нарезка; 
	//Субботин 30.11.22
	ТекущаяСтрока.Цена 						= 	ПолучитьЦену(ОбъектНоменклатуры.Номенклатура, Объект.Организация, Объект.Дата);
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоОбъектуНоменклатуры(ОбъектНоменклатуры) //+Лико m.shenderov 10.05.2023
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура",ОбъектНоменклатуры.Номенклатура); 
	Структура.Вставить("Серия",ОбъектНоменклатуры.Серия);
	Структура.Вставить("Количество",ОбъектНоменклатуры.Количество);
	Структура.Вставить("КоэффициентПересчетаУУ",ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель);
	Структура.Вставить("Нарезка",ОбъектНоменклатуры.Нарезка);
		
	Возврат Структура;
	
КонецФункции  //-Лико m.shenderov 10.05.2023



&НаСервере
Процедура МатериалыСерияПриИзмененииНаСервере()
	
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.КоэффициентПересчетаУУ = ТекущаяСтрока.Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения.Числитель;
	ТекущаяСтрока.МетражКВМ = ТекущаяСтрока.Количество * ТекущаяСтрока.КоэффициентПересчетаУУ;
	Элементы.Материалы.ТекущиеДанные.Номенклатура = ТекущаяСтрока.Серия.ЯССМ_ОбъектНоменклатуры.Номенклатура;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМетражПМПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.Количество = ТекущаяСтрока.МетражПМ;
	ТекущаяСтрока.МетражКВМ = ТекущаяСтрока.Количество * ТекущаяСтрока.КоэффициентПересчетаУУ;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыМетражКВМПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	Если ТекущаяСтрока.КоэффициентПересчетаУУ <> 0 Тогда
		ТекущаяСтрока.Количество = ТекущаяСтрока.МетражКВМ / ТекущаяСтрока.КоэффициентПересчетаУУ;
		ТекущаяСтрока.МетражПМ = ТекущаяСтрока.Количество;
	Иначе
		Сообщить("Для текущей строки не заполнен коэффициент пересчета УУ. Проверьте, заполнена ли серия. Если серия заполнена, то обратитесь к программистам");
		ТекущаяСтрока.Количество = 0;
		ТекущаяСтрока.МетражПМ = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	//МассивШК = Новый Массив;
	//МассивШК.Добавить(ДанныхШтрихкода.Штрихкод);
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтоНовыйДокумент И ЗавершениеРаботы Тогда
		Отказ = Истина;
		ТекстПредупреждения = "Перед закрытием 1С нужно сначала закрыть документ забраковки " + Объект.Номер + ", иначе он ""зависнет""";
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьДокументНепосредственно(СсылкаНаДокумент)
	
	УстановитьПривилегированныйРежим(Истина);
	ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	ДокументОбъект.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	ПараметрыИзРабочегоМеста = ПолучитьНеобходимыеПараметрыИзРабочегоМеста();
	
	Структура = Новый Структура;
	Структура.Вставить("Склад", ПараметрыИзРабочегоМеста.СкладСИМ);
	Структура.Вставить("Помещение", ПараметрыИзРабочегоМеста.ПомещениеСИМ);
	Структура.Вставить("Период", ТекущаяДата());
	Структура.Вставить("ТолькоОстатки", Истина);
	
	ОписаниеОповещения=Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбора_Склад",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНеобходимыеПараметрыИзРабочегоМеста()
	
	СтруктураПараметров = Новый Структура("СкладСИМ,ПомещениеСИМ");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, ПараметрыСеанса.Лико_РабочееМесто);
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(РезультатФормы,ПараметрыФормы) Экспорт //+Лико m.shenderov 25.10.2017
	
	Если ТипЗнч(РезультатФормы)=Тип("Массив") Тогда
		Для каждого Товар Из РезультатФормы Цикл
			Если Объект.Материалы.НайтиСтроки(Новый Структура("Серия", Товар.Серия)).Количество()=0 Тогда
				Модифицированность = Истина;
				НоваяСтрока=Объект.Материалы.Добавить(); 			 
				ЗаполнитьЗначенияСвойств(НоваяСтрока,Товар);
				НоваяСтрока.Количество = Товар.КоличествоУпаковок;
				НоваяСтрока.МетражПМ = НоваяСтрока.Количество;
				НоваяСтрока.КоэффициентПересчетаУУ = Товар.Коэффициент;
				НоваяСтрока.МетражКВМ = НоваяСтрока.Количество * НоваяСтрока.КоэффициентПересчетаУУ;
				Серия = НоваяСтрока.Серия;
				НоваяСтрока.Нарезка = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Серия.ЯССМ_ОбъектНоменклатуры.Нарезка", Серия, "Серия");   
				НоваяСтрока.Цена = ПолучитьЦену(Товар.Номенклатура, Объект.Организация, Объект.Дата);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 25.10.2017

&НаКлиенте
Процедура РабочийЦентрПриИзменении(Элемент)
	УстановкаВидимостиРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура МестоОбнаруженияПриИзменении(Элемент)
	УстановкаВидимостиРеквизитов();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьБирок(Команда)

	Для каждого Строка из Объект.Материалы Цикл
		Серия = Строка.Серия;
		ОбъектНоменклатуры = Лико_Дополнительно.ПолучитьЗначениеПредопределенныхДанных("Серия.ЯССМ_ОбъектНоменклатуры", Серия, "Серия");
		Лико_ДополнительноКлиент.ПечатьЯрлыкаОбъектаНоменклатуры(ОбъектНоменклатуры,,, Строка.Количество);
	КонецЦикла;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЦену(Номенклатура, Площадка, ДатаДокумента)//Субботин  30.11.2022
	
	Цена = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Лико_ЦеныГруппНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Лико_ЦеныГруппНоменклатуры.СрезПоследних(
		|			&Дата,
		|			ТипЦен = ЗНАЧЕНИЕ(Перечисление.Лико_ТипЦен.ЦенаПоставщика)
		|				И Площадка = &Площадка
		|				И ЦеноваяГруппа = &ЦеноваяГруппа) КАК Лико_ЦеныГруппНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ДатаДокумента);
	Запрос.УстановитьПараметр("Площадка", Площадка);
	Запрос.УстановитьПараметр("ЦеноваяГруппа", Номенклатура.ЦеноваяГруппа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();		
		Выборка.Следующий();	
		Цена = Выборка.Цена;  
	КонецЕсли;
	
	Возврат Цена
	
КонецФункции
